// 常用字，排序
IME.singleKey = [
  "",//a
  "把被不并比必帮八便别百办报变白保本表北布",//b
  "才从此次曾错存采擦寸层藏村猜词催匆聪苍刺",//c
  "的地大当得但到都对电多等定动东斗代倒道导",//d
  "",//e
  "发反法分份非放方防副风逢奉付负否废费犯冯",//f
  "个各更干过给刚搞高该敢共告改关工根跟赶管",//g
  "和或还会很好后回合获红黑黄活何换化号花话",//h
  "出场陈程长厂车成称城春差彻尺迟重产初穿船",//i
  "进就将即既及极级九加交接结己件叫假机几皆",//j
  "可开快看靠科肯刻口苦抗康空恐扣课棵刊克考",//k
  "了两来立连六另令里离利力理路领乐落冷楼量",//l
  "每没民某买卖慢名莫满明命忙们吗马妈目面摸",//m
  "你拿能男哪那弄南年内您闹耐脑宁农尼浓念娘",//n
  "",//o
  "平评碰派破颇爬凭跑抛排拍票朋片篇旁盘批皮",//p
  "全取确起去期七齐钱前请气缺清情晴群强球秋",//q
  "让二入然人认如软荣容弱柔肉扔仍忍辱绕润融",//r
  "是随三四送算司私死宋岁松洒塞思诉素俗苏",//s
  "天他她它通同投突体堂跳挑停团太题痛铜挺吐",//t
  "",//u
  "",//v
  "我王未为五伟勿务忘万妄物委伪卫娃维位握稳",//w
  "小心想现下显行响相像细谢雄信写血休羞秀芯",//x
  "已一亦又由有右优犹义意衣愿远洋阳杨英迎音",//y
  "在再自咱子作总左暂资字载赞宗",//z
];

IME.ZCSH = [
  "终知指长之这重至争整众折者值",//zh
  "常成长出查场厂差处除触称城吃察产唱迟春拆",//ch
  "上十说事实尚伤势谁顺啥水睡深神身伸"//sh
];

IME.initial = ['b', 'c', 'ch', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm', 'n', 'p', 'q', 'r', 's', 'sh', 't', 'w', 'x', 'y', 'z', 'zh'];

IME.vowels = ["a", "ai", "an", "ang", "ao", "e", "ei", "en", "eng", "er", "i", "ia", "ian", "iang", "iao", "ie", "in", "ing", "iong", "iu", "o", "ou", "ong", "u", "ua", "uai", "uan", "uang", "ue", "ui", "un", "uo", "v"];